[
    {
        "content":
            "Hello DataRobot!",
        "username":"gray"
    }, 
   
    {
        "content":
            "Hello Mr. Mills",
        "username":"blue"
    },    
    {
        "content":
            "Thank you for your interest in the HR Analyst position. We are a fast-growing company and this role will be of the utmost importance to our organization.",
        "username":"blue"
    },    
    {
        "content":
            "Before we invite you to an interview, we would like to know how your current set of skills and experience align with some core aspects of this role that we believe will determine your fit and success.",
        "username":"blue"
    },   
 
    {
        "content":
            "OK, sure.",
        "username":"gray"
    }, 
   
    {
        "content":
            "Please share any information that will help us better understand your ability to do the following:",
        "username":"blue"
    },    
    {
        "content":
            "Nurture relationships and collaborations with squad links and hiring managers to empower hiring with high-quality, clean data?",
        "username":"blue"
    },

    {
        "content":
            "I am a big-picture person and enjoy connecting the dots to get the full understanding of a situation or process. This requires knowing the interested parties, what they need, and how to best interact with them.",
        "username":"gray"
    },
    {
        "content":
            "The next step is selling them on the idea, and why it makes sense from their viewpoint. This is a challenge I find great fun in and have put into practice during my time at CIC, Tufts, and as a painting and maintenance contractor.",
        "username":"gray"
    },

    {
        "content":
            "OK, Thank you.",
        "username":"blue"
    },
    {
        "content":
            "Next is: ",
        "username":"blue"
    },
    {
        "content":
            "Develop and automate data and people analytics solutions, iteratively building and prototyping dashboards to provide insights at scale?",
        "username":"blue"
    },

    {
        "content":
            "I’ve built tools at my current job that allow aspects of the work to become fully automated and/or have automation assistance. This has required extracting structured information from various heterogenous data sources. I’ve also studied data analysis using python, pandas, and matplotlib in courses from MIT and Stanford.",
        "username":"gray"
    },
    {
        "content":
            "I tend to adopt new tools when they are suited for the job; for example, at Tufts I was introduced to AutoHotKey and its ability to automate the Windows UI and it allowed me to introduce tools for my daily work. My studies at Tufts have helped pushed me further down this road of discovery and adoption. I’ve recently completed web programming and database systems classes, sprouting a ton of ideas on how dashboards can be built and data can be stored. ",
        "username":"gray"
    },
    {
        "content":
            "I would love to see what works for DataRobot and then put these combined skills into practice.",
        "username":"gray"
    },

    {
        "content":
            "Hmmm, very interesting.",
        "username":"blue"
    },
    {
        "content":
            "OK, now:",
        "username":"blue"
    },
    {
        "content":
            "Provide visually effective reports to take the pulse of the hiring performance?",
        "username":"blue"
    },

    {
        "content":
            "I’ve used Tableau to extract insights from my work in our internal ticket request system and show trends in my interactions, processes, and behavior. Additionally, I have studied graphic design, web design and engineering science and have the skills to extract, interpret, and present data in a useful way.",
        "username":"gray"
    },

    {
        "content":
            "OK, and: ",
        "username":"blue"
    },
    {
        "content":
            "Collaborate with a recruiting team to perform pipeline health checks?",
        "username":"blue"
    },

    {
        "content":
            "This is my favorite part.",
        "username":"gray"
    },
    {
        "content":
            "A new system doesn’t work if users don't like it or it isn’t useful to them. Checking in with stakeholders and making necessary adjustments is critical and the most valuable step of the design and iteration process. Whether it’s social or technical, hurdles like this are what require the tact and understanding that I excel at.",
        "username":"gray"
    },

    {
        "content":
            "And how about: ",
        "username":"blue"
    },
    {
        "content":
            "Prioritize work to manage multiple workflows and high-pressure situations?",
        "username":"blue"
    },

    {
        "content":
            "Being a FT employee and a graduate student, I am comfortable handling competing priorities while still outputting high-caliber work.",
        "username":"gray"
    },
{
        "content":
            "I have been working at Tufts while taking classes for over a year and was recently accepted to the Masters program here. I’ve learned to develop systems of working that ensure things get done, and have been honest with myself when things do not work.",
        "username":"gray"
    },
    {
        "content":
            "I love a good pivot, and understand when it needs to happen. When it fits the situation, I also believe in the value of strategic compromise and negotiation and have fun going through that process with others.",
        "username":"gray"
    },
    {
        "content":
            "As an honest and independent person who also loves teamwork, I can assure you that when things get thrown against me I make sure they are taken care of, one way or another.",
        "username":"gray"
    },
    {
        "content":
            "Thank you Mr. Mills.",
        "username":"blue"
    },
    {
        "content":
            "I’m sure we now have enough information to decide whether to offer you an in-person interview.",
        "username":"blue"
    },
    {
        "content":
            "Thank You!",
        "username":"gray"
    },
    {
        "content":
            "Go DataRobot Go!",
        "username":"gray"
    },
    {
        "content":
            "Of course.",
        "username":"blue"
    },
    {
        "content":
            "Goodbye.",
        "username":"blue"
    },
    {
        "content":
            "...",
        "username":"gray"
    }
]
